{"id":253297,"date":"2022-07-26T23:05:06","date_gmt":"2022-07-26T23:05:06","guid":{"rendered":"https:\/\/industrialmarketer.com\/?p=253297"},"modified":"2022-07-29T02:53:29","modified_gmt":"2022-07-29T02:53:29","slug":"5-ways-industrial-companies-can-benefit-from-marketing-with-video","status":"publish","type":"post","link":"https:\/\/industrialmarketer.com\/5-ways-industrial-companies-can-benefit-from-marketing-with-video\/","title":{"rendered":"5 Ways Industrial Companies Can Benefit from Marketing with Video"},"content":{"rendered":"\n<p>Marketing with video is increasingly important to manufacturers and other industrial companies. Why?<\/p>\n\n\n\n<p>Video content is easy to consume and share, and it is incredibly effective because most people, manufacturers included, process visuals faster than text. If the incredible ramp up and conversion to digital marketing in manufacturing has taught us anything, it’s that industrial buyers are bringing their personal media consumption preferences to the job. They search online, they consume visual-centric content, and they share what they find.<\/p>\n\n\n\n<p>We could throw a ton of relevant stats at you about the importance of marketing with video in a B2B context. Here are two stats, and a <a href=\"https:\/\/www.weidert.com\/blog\/b2b-video-marketing-statistics#:~:text=86%25%20of%20businesses%20use%20video,were%20affected%20by%20the%20pandemic\">link<\/a> to more:<\/p>\n\n\n\n<ul><li>87% of B2B marketers say video has increased their traffic<\/li><li>96% of people have watched an explainer video about a product or company service<\/li><\/ul>\n\n\n\n<p>There also is a great argument for using videos from an inbound marketing lens. Video thumbnails are shown in search results, helping click-through rates, and search algorithms seem to favor pages with video content. Videos also boost user engagement by:&nbsp;<\/p>\n\n\n\n<ul><li>Increasing time on site, an important ranking factor<\/li><li>Creating backlinks as people share videos at a far greater rate than other content<\/li><\/ul>\n\n\n\n<p>In this episode of the <em>Industrial Marketer<\/em> podcast, Joey and Nels look at five ways for you to leverage the power of marketing with video for your industrial business.<\/p>\n\n\n\n<h2>Opportunities for Marketing with Video Based on Orientation<\/h2>\n\n\n\n<p>It might be easier for industrial marketers to sell the need for videos within their organization if they frame the possibilities along the ways the company currently goes to market. For example, you can put together a video plan based on:<\/p>\n\n\n\n<ul><li><strong>Products –<\/strong> Align this with your overall company goals and sales priorities by focusing on key products or initiatives. Start with capabilities and features.<\/li><li><strong>Database Segments –<\/strong> What videos will you produce for prospects and qualifying leads? What will appeal to customers to increase orders or accelerate deals? How do you market to past customers?<\/li><li><strong>Solutions –<\/strong> Produce videos that focus on what you have done to help your customers. <\/li><li><strong>Recruitment – <\/strong>Don’t overlook the most obvious low-hanging fruit for videos when it comes to <a href=\"https:\/\/industrialstrengthmarketing.com\/clients\/workforce-recruitment-marketing\/\">recruitment marketing<\/a>. Why should someone want to work at your company? Produce a video with your staff to answer this fundamental question!<\/li><\/ul>\n\n\n\n<p>Another strategy for developing a video content plan is around the buyer journey.<\/p>\n\n\n\n<ul><li><strong>Awareness – <\/strong>Focus on benefits, and keep the videos short.<\/li><li><strong>Consideration – <\/strong>These can be a little longer. The content might focus on comparisons with competitors or a success story of how you addressed a pain point for a customer.<\/li><li><strong>Decision –<\/strong> These videos can focus on ROI or how the purchase provides a competitive advantage.<\/li><\/ul>\n\n\n\n<h2>5 Types of Manufacturing Marketing Videos<\/h2>\n\n\n\n<p>It’s important to acknowledge that a highly produced video can be time consuming and expensive to produce. Some might involve motion graphics. On the other hand, you can have staff members produce videos with a smartphone. Maybe it’s someone on the shop floor doing a show-and-tell. If nothing else, experiment and track what works. You will learn a lot just by getting started. <\/p>\n\n\n\n<p>Here are 5 types of videos to consider.<\/p>\n\n\n\n<h3>1. Demo Videos for Product and Solutions<\/h3>\n\n\n\n<p>These could be solution overviews, with animated examples, or a simple look at what your product does. We’ll defer to <a href=\"https:\/\/blog.thomasnet.com\/why-manufacturers-use-video-marketing\">Thomas Video Advertising<\/a> for its description of  demo videos: “Demo videos demonstrate more complicated products or services. They teach your viewers how to do something with your product. Your demo video should capture how your product works — it&#8217;s a great shareable sales tool, too.”<\/p>\n\n\n\n<h3>2. Testimonials\/Case Studies\/ROI <\/h3>\n\n\n\n<p>These videos can be used by your sales team and on your website pages. Don’t forget about the value they bring to social channels to help distribute your mid-funnel content. These can be especially powerful as your customers are telling your story.<\/p>\n\n\n\n<h3>3. Brand Overviews<\/h3>\n\n\n\n<p>You have a great story to tell with the history of your manufacturing company. You also have a story to tell about your value propositions, brand promises, and reasons to believe in your brand. A simple way to get started is to produce an explainer video that showcases some aspect of your company.<\/p>\n\n\n\n<h3>4. Ongoing Series<\/h3>\n\n\n\n<p>This does not have to be as imposing as it sounds. Consider a package of videos based on:<\/p>\n\n\n\n<ul><li>Expert interviews on a group of products or types of solutions<\/li><li>A look at how your company works with different industries<\/li><li>Day-in-the-life videos of what it is like to work at your company<\/li><\/ul>\n\n\n\n<p>This can be a low-cost entry point into marketing with video. You will learn a lot just by doing, and tracking the results will provide insights on how to move forward.<\/p>\n\n\n\n<h3>5. Customer Service\/Thank You <\/h3>\n\n\n\n<p>Videos can also be part of <a href=\"https:\/\/industrialstrengthmarketing.com\/services\/sales-enablement\/\">B2B sales enablement<\/a> or <a href=\"https:\/\/industrialmarketer.com\/5-things-prepare-account-based-marketing\/\">account based marketing<\/a>. It would be a nice touch as a new customer to receive a “welcome aboard” message from the entire company (a one-time video shot that could be repurposed for many sales) or a personalized message from the CEO or a sales application engineer. <\/p>\n\n\n\n<p>Another easy to produce video is one that depicts “what it is like to work with us.” The onboarding of a new client should not be taken for granted, and this messaging can help your new liaison pass on vital information using terminology you prefer.<\/p>\n\n\n\n<p>It’s also a chance to brag on the scope of your capabilities, which means if this new client likes the work you do, you have already planted the seeds for organic sales growth (e.g., &#8220;Our machines will help you address your pain points, and you should see what our predictive and preventive maintenance can do to increase the lifetime value of your investment.&#8221;)<\/p>\n\n\n\n<h2>Listen to the Podcast for More Ways to Do Marketing with Video<\/h2>\n\n\n\n<p>For more insights into how to leverage videos for industrial marketing, tune into Episode 33 of the <em>Industrial Marketer<\/em> podcast.<\/p>\n\n\n\n<div id=\"buzzsprout-player-11026055\"><\/div><script src=\" https:\/\/www.buzzsprout.com\/1056112\/11026055-top-5-ways-industrial-marketers-should-be-using-video.js?container_id=buzzsprout-player-11026055&#038;player=small \" type=\"text\/javascript\" charset=\"utf-8\"><\/script>\n\n\n\n<h2>Subscribe to the Industrial Marketer Podcast<\/h2>\n\n\n\n<p>The&nbsp;<em>Industrial Marketer<\/em>&nbsp;podcast comes out twice a month. To subscribe, visit&nbsp;<a href=\"https:\/\/www.buzzsprout.com\/1056112\">our Buzzsprout show page<\/a>&nbsp;and select your podcast platform of choice.<\/p>\n\n\n\n<p>And if you have any ideas for topics you’d like us to cover on the podcast —&nbsp;or here on the&nbsp;<em>Industrial Marketer<\/em>&nbsp;website — send us a message on&nbsp;<a href=\"https:\/\/www.facebook.com\/IndustrialMarketer\">Facebook<\/a>&nbsp;or&nbsp;<a href=\"https:\/\/twitter.com\/indmktr\">Twitter<\/a>&nbsp;and let us know!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Marketing with video is increasingly important to manufacturers and other industrial companies. Why? Video content is easy to consume and share, and it is incredibly effective because most people, manufacturers included, process visuals faster than text. If the incredible ramp up and conversion to digital marketing in manufacturing has taught us anything, it’s that industrial&#8230;  <a class=\"excerpt-read-more\" href=\"https:\/\/industrialmarketer.com\/5-ways-industrial-companies-can-benefit-from-marketing-with-video\/\" title=\"Read5 Ways Industrial Companies Can Benefit from Marketing with Video\">Read more &raquo;<\/a><\/p>\n","protected":false},"author":216,"featured_media":253302,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[155,142],"tags":[260,258],"_links":{"self":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253297"}],"collection":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/users\/216"}],"replies":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/comments?post=253297"}],"version-history":[{"count":6,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253297\/revisions"}],"predecessor-version":[{"id":253307,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253297\/revisions\/253307"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/media\/253302"}],"wp:attachment":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/media?parent=253297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/categories?post=253297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/tags?post=253297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}