{"id":253282,"date":"2022-06-28T23:01:11","date_gmt":"2022-06-28T23:01:11","guid":{"rendered":"https:\/\/industrialmarketer.com\/?p=253282"},"modified":"2022-06-30T19:16:53","modified_gmt":"2022-06-30T19:16:53","slug":"5-best-practices-industrial-web-design","status":"publish","type":"post","link":"https:\/\/industrialmarketer.com\/5-best-practices-industrial-web-design\/","title":{"rendered":"5 Best Practices for Industrial Web Design"},"content":{"rendered":"\n<p>Much has changed in the industrial web design in the past two-plus years, driven mostly by the massive shift to digital research. So it’s no surprise that industrial buyers have high expectations when they visit your website. They expect to learn how you can help alleviate their pain points, see what your products can do for them, and that you will be able to answer their specific questions — all in a manner convenient for them. They expect as little friction as possible to figure out if you are a serious contender for their business.<\/p>\n\n\n\n<p>Industrial buyers also bring their consumer expectations to the table. If you can get a quote for the options and colors you want on a $45,000 automobile, why can’t you configure your next $60,000 machine?&nbsp;<\/p>\n\n\n\n<p>In this episode of the <em>Industrial Marketer<\/em> podcast, Joey and Nels discuss how the bar has been raised in terms of what people expect from your industrial web design. They look at five best practices for you to keep in mind, whether you are fine-tuning a great website or playing catchup from that “recent redesign” that was actually almost 10 years ago.<\/p>\n\n\n\n<h2>1.&nbsp;Show and Tell: Visuals Are Paramount<\/h2>\n\n\n\n<p>The biggest “low hanging fruit” opportunity for lagging industrial websites is to improve their visual content. We are a visual society; we want to see what we are buying, how things work, and how they solve our problems. Industrial buyers expect to be informed but they also want to be shown.<\/p>\n\n\n\n<p>Here’s the simple “hack” to get started improving your industrial web design: Provide a CAD file for a product or part. According to the 2021 Industrial Sales and Marketing report, <a href=\"https:\/\/www.prnewswire.com\/news-releases\/cadenas-2021-industrial-marketing-report-reveals-92-of-engineers-and-architects-consider-a-3d-preview-important-for-product-selection-301249306.html\">82% of engineers who download a CAD file<\/a> for a part ultimately make a purchase.&nbsp;<\/p>\n\n\n\n<p>One of our favorite industrial websites is <a href=\"https:\/\/www.siemens.com\/global\/en.html\">Siemens USA<\/a>, which does a great job with visuals, from photos to CAD drawings, animated videos with contextual information and more. We realize Siemens is one of the biggest 150 companies in the world, so they can build a tremendous website. But the point is that they choose to emphasize visuals. You can, too.<\/p>\n\n\n\n<h2>2. Formatting: Navigation\/Page Hierarchy Is Important<\/h2>\n\n\n\n<p>The Siemens website also does a great job of helping you navigate their site. They offer the chance to choose your own path, which means you are quickly looking at what you actually came to the site to see. It is a great experience.<\/p>\n\n\n\n<p>Another industrial webs design we like for navigation and page hierarchy is <a href=\"https:\/\/lightmatter.co\/\">Lightmatter<\/a>, which is in the photonic computing space. They are at the intersection of photonics, electronics and AI. (Photonics is the science of creating, moving, and detecting photons. It brings together physics, electrical engineering, and materials science knowledge about photons and electrons. Or, for the majority of us in marketing, this is a more simple explanation: A photon checks into a hotel, and the clerk asks if the photon has any luggage, and the photon says, “No, I’m traveling light.”)<\/p>\n\n\n\n<p>The Lightmatter site is small, perhaps a dozen pages total, but the site’s navigation is streamlined and simple. It directs its users on where to find the most relevant information without any distractions and the top-level navigation is impossible to get lost in (Home, Story, Products, People, News, Contact Us). They make a complicated product (photonic processors), but their navigation and site direction keep things simple for users.&nbsp;<\/p>\n\n\n\n<p>The lesson here is that if your website is properly structured and easy to navigate, it provides better user experience and improves SEO. That should help convert more leads and drive business.<\/p>\n\n\n\n<h2>3. Clear CTAs : Tell Them What to Do<\/h2>\n\n\n\n<p>Perhaps we have overcomplicated this aspect of our websites as marketers often confuse their approaches for a social CTA or an email CTA with that on their core website. The Call To Action on your website should not be complicated. In this context, people are already on your website. How can you reduce friction and get them to where you want them to go? Use 3–5 words to tell the user what you want them to do. Such as:<\/p>\n\n\n\n<ul><li>Download the report<\/li><li>Get the guide<\/li><li>Read more<\/li><\/ul>\n\n\n\n<p>If you are not sure which of these to use, do A\/B variant testing to see what works better. Likewise, experiment with the color of your button in relation to your site colors. Blue button or red button? Test it out.<\/p>\n\n\n\n<p>The <a href=\"https:\/\/www.dupont.com\/\">DuPont<\/a> website does a great job with CTAs.&nbsp;<\/p>\n\n\n\n<h2>4. Content Focus for Your Many Users<\/h2>\n\n\n\n<p>One of the recent trends in the industrial buying cycle is the emergence of <a href=\"https:\/\/industrialmarketer.com\/industrial-buying-rise-buying-committees\/\">the buying committee<\/a>. It is now common for companies to bring together stakeholders from operations, facility and finance to vet solutions and make purchase recommendations.&nbsp;<\/p>\n\n\n\n<p>How do you account for these multi-users? The first step is to be able to understand their perspective and answer their individual questions. An engineer might be looking at specifications and capabilities. A facility manager will have different concerns about floor space and energy use. The finance person is looking at ROI.<\/p>\n\n\n\n<p>The hard truth is that you will need to provide more varied content than ever. Years ago, you&nbsp;could count on your sales network to communicate certain information to prospects. But you can only navigate to the content you have. FAQs, case studies, ROI calculators are all valuable content from the perspective of stakeholders. In many ways, we’re talking about an <a href=\"https:\/\/industrialmarketer.com\/5-things-prepare-account-based-marketing\/\">account-based marketing approach<\/a>. If you have several visitors from the same company looking at one of your solutions, how do you approach this from a sales perspective?&nbsp;You might not be using ABM technology, but you should be building a content menu with ABM in mind.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.sandvik.coromant.com\/en-us\/pages\/default.aspx\">Sandvik Coromant<\/a> has few peers in the tooling and industrial sectors when it comes to the variety of content they provide and how well they package it. Whatever questions people have, they are trying to address.<\/p>\n\n\n\n<h2>5. Use the Right Words (SEO)<\/h2>\n\n\n\n<p>The final best practice is to master your keywords. Search engine optimization is more than having a keyword in your page title. It is critical to understand how search engines see your website and adjust in real time to account for changes in search algorithms and online rankings. SEO for industrials is part science and part art, but the key areas to pay attention to are:<\/p>\n\n\n\n<ul><li>Keyword focus for all pages<\/li><li>Eliminating technical waste in website code<\/li><li>Building depth of content in key areas<\/li><li>Growing off-site authority<\/li><\/ul>\n\n\n\n<p>Keep in mind the questions that prospects are asking. “Long tail” search terms are&nbsp;longer and more specific keyword phrases that visitors are more likely to use when they&#8217;re closer to a point-of-purchase or when they&#8217;re using voice search. Most long-tail keywords have lower search volume than short or “head” keywords. So while they may get less search traffic, they often will attract a more motivated prospect and have a higher conversion value.<\/p>\n\n\n\n<h2>Listen to the Podcast for More on Industrial Web Design Best Practices&nbsp;<\/h2>\n\n\n\n<p>For more insights into how to improve your industrial website, tune into Episode 32 of the <em>Industrial Marketer<\/em> podcast.<\/p>\n\n\n\n<div id=\"buzzsprout-player-10864396\"><\/div><script src=\" https:\/\/www.buzzsprout.com\/1056112\/10864396-5-best-practices-for-industrial-website-design-in-2022.js?container_id=buzzsprout-player-10864396&amp;player=small \" type=\"text\/javascript\" charset=\"utf-8\"><\/script>\n\n\n\n<h2>Subscribe to the Industrial Marketer Podcast<\/h2>\n\n\n\n<p>The&nbsp;<em>Industrial Marketer<\/em>&nbsp;podcast comes out twice a month. To subscribe, visit&nbsp;<a href=\"https:\/\/www.buzzsprout.com\/1056112\">our Buzzsprout show page<\/a>&nbsp;and select your podcast platform of choice.<\/p>\n\n\n\n<p>And if you have any ideas for topics you’d like us to cover on the podcast —&nbsp;or here on the&nbsp;<em>Industrial Marketer<\/em>&nbsp;website — send us a message on&nbsp;<a href=\"https:\/\/www.facebook.com\/IndustrialMarketer\">Facebook<\/a>&nbsp;or&nbsp;<a href=\"https:\/\/twitter.com\/indmktr\">Twitter<\/a>&nbsp;and let us know!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Much has changed in the industrial web design in the past two-plus years, driven mostly by the massive shift to digital research. So it’s no surprise that industrial buyers have high expectations when they visit your website. They expect to learn how you can help alleviate their pain points, see what your products can do&#8230;  <a class=\"excerpt-read-more\" href=\"https:\/\/industrialmarketer.com\/5-best-practices-industrial-web-design\/\" title=\"Read5 Best Practices for Industrial Web Design\">Read more &raquo;<\/a><\/p>\n","protected":false},"author":216,"featured_media":253284,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[158],"tags":[233,260,226],"_links":{"self":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253282"}],"collection":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/users\/216"}],"replies":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/comments?post=253282"}],"version-history":[{"count":2,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253282\/revisions"}],"predecessor-version":[{"id":253295,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/posts\/253282\/revisions\/253295"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/media\/253284"}],"wp:attachment":[{"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/media?parent=253282"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/categories?post=253282"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/industrialmarketer.com\/wp-json\/wp\/v2\/tags?post=253282"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}